### 연습 문제 1

#### 타이타닉 승객 데이터를 이용하여 다음 분석을 실시하라. 데이터는 다음과 같이 받을 수 있다.
#### 1. qcut 명령으로 세 개의 나이 그룹을 만든다

In [15]:
import seaborn as sns
import pandas as pd

titanic = sns.load_dataset("titanic")

titanic["age_class"] = pd.qcut(titanic.age, 3, labels=["Young", "Middle", "Senior"])
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_class
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,Middle
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,Young
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,Middle
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,Middle

#### 2. 성별, 선실, 나이 그룹에 의한 생존율을 데이터프레임으로 계산한다. 행에는 성별 및 나이 그룹에 대한 다중 인덱스를 사용하고 열에는 선실 인덱스를 사용한다.

In [26]:
titanic.pivot_table('survived', index=['sex', 'age_class'], aggfunc='mean', columns='class')

class                First    Second     Third
sex    age_class
female Young      0.954545  1.000000  0.508475
       Middle     0.947368  0.909091  0.481481
       Senior     0.977273  0.857143  0.250000
male   Young      0.500000  0.357143  0.158879
       Middle     0.500000  0.076923  0.195652
       Senior     0.347826  0.062500  0.055556

#### 3. 성별 및 선실에 의한 생존율을 피봇 데이터 형태로 만든다

In [21]:
titanic.pivot_table("survived", "sex", "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447